from string import Template

### مطالب مولد استجابة الاسترجاع (RAG)

system_prompt = Template("\n".join([
    "أنت تُسمى Mini-Rag.",
    "أنت مساعد لتوليد إجابات للمستخدم.",
    "يجب عليك توليد الإجابات بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المتعلقة بالاستفسار."
]))

### المستند
document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

### التذييل
footer_prompt = Template(
    "\n".join([
        "بناءً فقط على المستند أعلاه، يرجى توليد إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "",
        "## الإجابة:",
    ])
)
